[
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f0" },
    "name": "jack burpee",
    "description": "The jack burpee is a high-intensity, full-body exercise that combines a squat, push-up, and jump to elevate heart rate and improve cardiovascular fitness while also engaging multiple muscle groups.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "body weight",
    "difficulty": "advanced",
    "instructions": [
      "Start in a standing position with your feet shoulder-width apart.",
      "Lower your body into a squat position, placing your hands on the ground in front of you.",
      "Kick your feet back, landing in a push-up position.",
      "Perform a push-up, lowering your chest to the ground and then pushing back up.",
      "Jump your feet forward, landing in a squat position.",
      "Jump up explosively, reaching your arms overhead.",
      "Land softly and immediately lower back into the squat position to begin the next repetition."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f1" },
    "name": "mountain climber",
    "description": "Mountain climbers are a dynamic bodyweight exercise that targets the cardiovascular system while also engaging the core, shoulders, and triceps. The movement mimics a running motion in a plank position, making it effective for both cardio and muscular endurance.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "body weight",
    "difficulty": "beginner",
    "instructions": [
      "Start in a high plank position with your hands directly under your shoulders and your body in a straight line.",
      "Engage your core and bring your right knee towards your chest, then quickly switch and bring your left knee towards your chest.",
      "Continue alternating legs in a running motion, keeping your hips low and your core engaged.",
      "Maintain a steady pace and breathe evenly throughout the exercise.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f2" },
    "name": "run (equipment)",
    "description": "Running in place is a cardiovascular exercise that elevates the heart rate and improves overall endurance. It requires no equipment and can be performed anywhere, making it accessible for most fitness levels.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "body weight",
    "difficulty": "beginner",
    "instructions": [
      "Start by standing upright with your feet hip-width apart.",
      "Engage your core and keep your upper body relaxed.",
      "Begin jogging in place, lifting your knees up towards your chest and landing softly on the balls of your feet.",
      "Maintain a steady pace and continue jogging for the desired duration or distance.",
      "Remember to breathe deeply and maintain good posture throughout the exercise."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f3" },
    "name": "run",
    "description": "Running is a fundamental cardiovascular exercise that involves jogging or running in place or over a distance. It primarily targets the cardiovascular system and also engages the lower body muscles.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "body weight",
    "difficulty": "beginner",
    "instructions": [
      "Start by standing upright with your feet hip-width apart.",
      "Engage your core and keep your upper body relaxed.",
      "Begin jogging in place, lifting your knees up towards your chest and landing softly on the balls of your feet.",
      "Maintain a steady pace and continue jogging for the desired duration or distance.",
      "Remember to breathe deeply and maintain good posture throughout the exercise."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f4" },
    "name": "stationary bike walk",
    "description": "The stationary bike walk is a cardiovascular exercise performed on a leverage machine (stationary bike). It primarily targets the cardiovascular system and also engages the quadriceps, hamstrings, and calves. The exercise involves pedaling at a steady pace, with the option to adjust resistance for increased intensity.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "leverage machine",
    "difficulty": "beginner",
    "instructions": [
      "Adjust the seat height and position on the stationary bike to ensure proper alignment.",
      "Place your feet on the pedals and secure them with the straps if available.",
      "Start pedaling at a comfortable pace, keeping your back straight and core engaged.",
      "Maintain a steady rhythm and increase the resistance level if desired.",
      "Continue pedaling for the desired duration of your cardio workout.",
      "Cool down by gradually reducing your pace and resistance level.",
      "Stretch your leg muscles after the workout to prevent tightness and promote recovery."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f5" },
    "name": "burpee",
    "description": "The burpee is a full-body exercise that combines a squat, push-up, and jump to elevate heart rate and build strength and endurance.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "body weight",
    "difficulty": "intermediate",
    "instructions": [
      "Start in a standing position with your feet shoulder-width apart.",
      "Lower your body into a squat position by bending your knees and placing your hands on the floor in front of you.",
      "Kick your feet back into a push-up position.",
      "Perform a push-up, keeping your body in a straight line.",
      "Jump your feet back into the squat position.",
      "Jump up explosively, reaching your arms overhead.",
      "Land softly and immediately lower back into a squat position to begin the next repetition."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f6" },
    "name": "dumbbell burpee",
    "description": "The dumbbell burpee is a full-body exercise that combines a squat, push-up, and overhead press using dumbbells. It targets the cardiovascular system while also engaging multiple muscle groups, including the legs, shoulders, triceps, and core.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "dumbbell",
    "difficulty": "advanced",
    "instructions": [
      "Start in a standing position with your feet shoulder-width apart and a dumbbell in each hand.",
      "Lower your body into a squat position, placing the dumbbells on the ground in front of you.",
      "Kick your feet back into a push-up position, keeping your body in a straight line.",
      "Perform a push-up, bending your elbows and lowering your chest towards the ground.",
      "Jump your feet back towards your hands, landing in a squat position.",
      "Stand up explosively, lifting the dumbbells off the ground and bringing them to your shoulders.",
      "Press the dumbbells overhead, fully extending your arms.",
      "Lower the dumbbells back to your shoulders and repeat the entire sequence for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f7" },
    "name": "stationary bike run v. 3",
    "description": "The stationary bike run v. 3 is a cardiovascular exercise performed on a stationary bike. It primarily targets the cardiovascular system and also engages the quadriceps, hamstrings, and calves. The exercise involves pedaling at a steady rhythm, adjusting resistance as needed, and maintaining proper posture throughout the workout.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "stationary bike",
    "difficulty": "beginner",
    "instructions": [
      "Adjust the seat height and position to ensure proper alignment.",
      "Place your feet on the pedals and secure them with the straps if available.",
      "Start pedaling at a comfortable pace.",
      "Maintain a steady rhythm and increase the resistance as desired.",
      "Engage your core muscles to maintain stability and proper posture.",
      "Continue pedaling for the desired duration of your workout.",
      "Gradually decrease the resistance and slow down before coming to a complete stop.",
      "Stretch your legs and cool down after the workout."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f8" },
    "name": "walk elliptical cross trainer",
    "description": "The walk elliptical cross trainer is a cardiovascular exercise performed on an elliptical machine. It simulates a walking or running motion with low impact on the joints, making it suitable for a wide range of fitness levels. The exercise targets the cardiovascular system while also engaging the quadriceps, hamstrings, glutes, and calves.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "elliptical machine",
    "difficulty": "beginner",
    "instructions": [
      "Adjust the resistance level and incline of the elliptical machine to your desired settings.",
      "Step onto the pedals of the machine and grip the handles lightly.",
      "Begin by pushing down with your feet and pulling the handles towards your body.",
      "Continue this motion, alternating between pushing and pulling, to simulate a walking or running motion.",
      "Maintain a steady pace and keep your core engaged throughout the exercise.",
      "Continue for the desired duration of your cardio workout.",
      "Gradually decrease the intensity and speed of the machine before stepping off."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb3f9" },
    "name": "walking on stepmill",
    "description": "Walking on a stepmill is a cardiovascular exercise performed on a machine that simulates stair climbing. It primarily targets the cardiovascular system while also engaging the lower body muscles.",
    "muscleGroup": "cardiovascular system",
    "type": "cardio",
    "equipment": "stepmill machine",
    "difficulty": "beginner",
    "instructions": [
      "Adjust the stepmill machine to a comfortable level.",
      "Step onto the machine and place your hands on the handrails for support.",
      "Start walking by placing one foot on a step and then the other, alternating between legs.",
      "Maintain an upright posture and engage your core muscles.",
      "Continue walking for the desired duration or distance.",
      "Gradually increase the intensity or speed as you become more comfortable with the exercise.",
      "Remember to cool down and stretch after completing the exercise."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  }
]
