[
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb430" },
    "name": "assisted prone hamstring",
    "description": "The assisted prone hamstring exercise targets the hamstrings with assistance from a partner or resistance band, making it accessible for those developing strength or needing support. It involves lying face down and curling the legs towards the glutes, focusing on hamstring engagement.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "assisted",
    "difficulty": "beginner",
    "instructions": [
      "Lie face down on a mat or bench with your legs fully extended.",
      "Have a partner or use a resistance band to secure your ankles.",
      "Engage your hamstrings and lift your legs towards your glutes, keeping your knees straight.",
      "Pause for a moment at the top, then slowly lower your legs back down to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb431" },
    "name": "barbell good morning",
    "description": "The barbell good morning is a compound exercise that targets the hamstrings and lower back. It involves hinging at the hips with a barbell on your upper back, requiring good form and core stability to perform safely.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": [
      "Start by standing with your feet shoulder-width apart and the barbell resting on your upper back.",
      "Keeping your back straight and your core engaged, hinge forward at the hips, pushing your buttocks back as if you were trying to touch the wall behind you with your glutes.",
      "Lower your torso until it is parallel to the ground, feeling a stretch in your hamstrings.",
      "Pause for a moment, then return to the starting position by squeezing your glutes and pushing your hips forward.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb432" },
    "name": "barbell straight leg deadlift",
    "description": "The barbell straight leg deadlift is a compound exercise targeting the hamstrings, with secondary emphasis on the glutes and lower back. It requires maintaining a straight back and proper hip hinge to safely stretch and strengthen the posterior chain.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": [
      "Stand with your feet shoulder-width apart and your toes pointing forward.",
      "Hold the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Bend at your hips and lower the barbell towards the ground, keeping your back straight and your knees slightly bent.",
      "Lower the barbell until you feel a stretch in your hamstrings.",
      "Engage your hamstrings and glutes to lift the barbell back up to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb433" },
    "name": "dumbbell lying femoral",
    "description": "The dumbbell lying femoral exercise targets the hamstrings and also works the glutes. It involves lying on your back, bending your knees, and using a dumbbell for resistance as you bring your feet towards your glutes.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": [
      "Lie flat on your back with your legs extended and a dumbbell resting on your lower abdomen.",
      "Bend your knees and bring the dumbbell towards your glutes, keeping your feet flat on the ground.",
      "Pause for a moment at the top, then slowly lower the dumbbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb434" },
    "name": "inverse leg curl (bench support)",
    "description": "The inverse leg curl (bench support) is a bodyweight exercise targeting the hamstrings, performed lying face down on a bench while curling the legs toward the glutes.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "body weight",
    "difficulty": "intermediate",
    "instructions": [
      "Lie face down on a bench with your hips at the edge and your legs extended straight behind you.",
      "Hold onto the bench for support.",
      "Keeping your upper body still, bend your knees and curl your legs towards your glutes.",
      "Pause for a moment at the top, then slowly extend your legs back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb435" },
    "name": "kettlebell hang clean",
    "description": "The kettlebell hang clean is a dynamic exercise that targets the hamstrings and also works the glutes, quadriceps, and calves. It involves swinging a kettlebell from between the legs up to the rack position at the shoulder, requiring explosive hip extension, coordination, and proper technique to perform safely.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "kettlebell",
    "difficulty": "intermediate",
    "instructions": [
      "Stand with your feet shoulder-width apart, holding a kettlebell in front of your thighs.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Lower the kettlebell towards the ground, allowing it to swing between your legs.",
      "Quickly extend your hips and knees, using the momentum to swing the kettlebell up to shoulder height.",
      "As the kettlebell reaches shoulder height, rotate your wrists and catch the kettlebell in the rack position, with your elbow tucked in and the kettlebell resting on your forearm.",
      "Lower the kettlebell back down to the starting position between your legs, and repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb436" },
    "name": "kick out sit",
    "description": "The kick out sit is a bodyweight exercise that targets the hamstrings while also engaging the quadriceps and glutes. It involves sitting on the edge of a bench or chair, extending the legs out, and then returning to the starting position.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "body weight",
    "difficulty": "beginner",
    "instructions": [
      "Sit on the edge of a bench or chair with your feet flat on the ground and your knees bent at a 90-degree angle.",
      "Lean back slightly and place your hands on the edge of the bench or chair for support.",
      "Engaging your hamstrings, lift your feet off the ground and extend your legs straight out in front of you.",
      "Pause for a moment at the top, then slowly bend your knees and bring your feet back towards your body.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb437" },
    "name": "lever kneeling leg curl",
    "description": "The lever kneeling leg curl is an isolation exercise targeting the hamstrings, performed on a leverage machine while kneeling. It primarily works the hamstrings and also engages the glutes as secondary muscles.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "leverage machine",
    "difficulty": "intermediate",
    "instructions": [
      "Adjust the machine to fit your body and select the desired weight.",
      "Kneel on the machine facing downwards, with your knees resting on the pad and your feet secured under the footpads.",
      "Grasp the handles or the sides of the machine for stability.",
      "Keeping your upper body stationary, exhale and curl your legs up towards your glutes by flexing your knees.",
      "Pause for a moment at the top of the movement, squeezing your hamstrings.",
      "Inhale and slowly lower your legs back to the starting position, fully extending your knees.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb438" },
    "name": "lever lying leg curl",
    "description": "The lever lying leg curl is an isolation exercise targeting the hamstrings, performed on a leverage machine. It involves curling the legs upward against resistance while lying face down, emphasizing hamstring contraction and control.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "leverage machine",
    "difficulty": "beginner",
    "instructions": [
      "Adjust the machine to fit your body and select the desired weight.",
      "Lie face down on the machine with your legs straight and your heels against the padded lever.",
      "Grasp the handles or the sides of the machine for stability.",
      "Keeping your upper body stationary, exhale and curl your legs up as far as possible without lifting your hips off the pad.",
      "Hold the contracted position for a brief pause as you squeeze your hamstrings.",
      "Inhale and slowly lower the lever back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  },
  {
    "_id": { "$oid": "687e744ab5aea82fc84cb439" },
    "name": "lever seated leg curl",
    "description": "The lever seated leg curl is a machine-based exercise that targets the hamstrings. It involves curling your lower legs against resistance while seated, isolating the hamstrings and minimizing involvement from other muscle groups.",
    "muscleGroup": "hamstrings",
    "type": "strength",
    "equipment": "leverage machine",
    "difficulty": "beginner",
    "instructions": [
      "Adjust the machine to fit your body and sit on it with your back against the backrest.",
      "Place your lower legs under the padded lever, just above your ankles.",
      "Grasp the handles on the sides of the machine for support.",
      "Keeping your upper legs stationary, exhale and curl your legs up as far as possible.",
      "Hold the contracted position for a brief pause as you squeeze your hamstrings.",
      "Inhale and slowly lower the lever back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": { "$date": "2025-07-24T00:00:00.000Z" },
    "updatedAt": { "$date": "2025-07-24T00:00:00.000Z" }
  }
]
