[
  {
    "_id": "687e744ab5aea82fc84cb355",
    "name": "barbell bent over row",
    "description": "The barbell bent over row is a compound exercise targeting the upper back, requiring the lifter to hinge at the hips and pull a barbell towards the torso. It develops strength and muscle mass in the upper back, biceps, and forearms, and demands good posture and core stability.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": [
      "Stand with your feet shoulder-width apart and knees slightly bent.",
      "Bend forward at the hips while keeping your back straight and chest up.",
      "Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart.",
      "Pull the barbell towards your lower chest by retracting your shoulder blades and squeezing your back muscles.",
      "Pause for a moment at the top, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  },
  {
    "_id": "687e744ab5aea82fc84cb356",
    "name": "barbell incline row",
    "description": "The barbell incline row is a compound exercise targeting the upper back, performed while lying face down on an incline bench and pulling a barbell towards the chest.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": [
      "Set up an incline bench at a 45-degree angle.",
      "Lie face down on the bench with your chest against the pad and your feet flat on the ground.",
      "Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart.",
      "Keep your back straight and your core engaged.",
      "Pull the barbell towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  },
  {
    "_id": "687e744ab5aea82fc84cb357",
    "name": "barbell one arm bent over row",
    "description": "The barbell one arm bent over row is a unilateral strength exercise targeting the upper back, requiring balance, coordination, and core stability. It is performed by bending at the hips, keeping the back straight, and rowing a barbell with one arm while maintaining a stable position.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": [
      "Stand with your feet shoulder-width apart, knees slightly bent, and hold a barbell with one hand using an overhand grip.",
      "Bend forward at the hips, keeping your back straight and your head in a neutral position.",
      "Pull the barbell up towards your chest, keeping your elbow close to your body and squeezing your shoulder blades together.",
      "Lower the barbell back down to the starting position in a controlled manner.",
      "Repeat for the desired number of repetitions, then switch to the other arm."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  },
  {
    "_id": "687e744ab5aea82fc84cb358",
    "name": "barbell reverse grip bent over row",
    "description": "The barbell reverse grip bent over row is a compound exercise targeting the upper back, with secondary emphasis on the biceps and forearms. It involves pulling a barbell towards the lower chest while bent over, requiring good form and core stability.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": [
      "Stand with your feet shoulder-width apart and knees slightly bent.",
      "Hold a barbell with an overhand grip, palms facing down, and hands slightly wider than shoulder-width apart.",
      "Bend forward at the hips, keeping your back straight and chest up, until your torso is almost parallel to the floor.",
      "Pull the barbell towards your lower chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top, then slowly lower the barbell back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  },
  {
    "_id": "687e744ab5aea82fc84cb359",
    "name": "cable decline seated wide-grip row",
    "description": "The cable decline seated wide-grip row is a strength exercise targeting the upper back, performed on a decline bench using a cable machine. It also engages the biceps and forearms as secondary muscles.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "cable",
    "difficulty": "intermediate",
    "instructions": [
      "Sit on the decline bench facing the cable machine with your feet securely placed on the footrests.",
      "Grasp the cable attachment with a wide overhand grip, palms facing down.",
      "Lean back slightly, keeping your back straight and your core engaged.",
      "Pull the cable towards your lower chest, squeezing your shoulder blades together.",
      "Pause for a moment at the peak of the contraction, then slowly release the cable back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  },
  {
    "_id": "687e744ab5aea82fc84cb35a",
    "name": "cable floor seated wide-grip row",
    "description": "The cable floor seated wide-grip row is a strength exercise targeting the upper back, performed seated on the floor using a cable machine. It emphasizes scapular retraction and upper back engagement, with secondary activation of the biceps and forearms.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "cable",
    "difficulty": "intermediate",
    "instructions": [
      "Sit on the floor with your legs extended and your back straight.",
      "Attach a cable handle to a low pulley and position the cable machine behind you.",
      "Grasp the handle with a wide overhand grip, palms facing down.",
      "Lean back slightly, keeping your back straight and your chest lifted.",
      "Pull the handle towards your waist, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement, then slowly release the handle back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  },
  {
    "_id": "687e744ab5aea82fc84cb35b",
    "name": "cable high row (kneeling)",
    "description": "The cable high row (kneeling) is a strength exercise targeting the upper back, performed using a cable machine while kneeling. It emphasizes scapular retraction and upper back engagement, with secondary involvement of the biceps and shoulders.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "cable",
    "difficulty": "intermediate",
    "instructions": [
      "Attach a straight bar to a cable machine at chest height.",
      "Kneel down in front of the cable machine and grab the bar with an overhand grip, hands shoulder-width apart.",
      "Sit back on your heels, keeping your back straight and your core engaged.",
      "Pull the bar towards your upper abdomen, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement, then slowly release the bar back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  },
  {
    "_id": "687e744ab5aea82fc84cb35c",
    "name": "cable low seated row",
    "description": "The cable low seated row is a strength exercise targeting the upper back, performed on a cable machine. It also engages the biceps and forearms as secondary muscles. The movement involves pulling the cable handles toward the torso while maintaining a straight back and squeezing the shoulder blades together.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "cable",
    "difficulty": "beginner",
    "instructions": [
      "Sit on the machine with your feet flat on the footrests and your knees slightly bent.",
      "Grasp the handles with an overhand grip, palms facing down.",
      "Keep your back straight and lean slightly forward, maintaining a slight bend in your elbows.",
      "Pull the handles towards your body, squeezing your shoulder blades together.",
      "Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position.",
      "Repeat for the desired number of repetitions."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  },
  {
    "_id": "687e744ab5aea82fc84cb35d",
    "name": "cable one arm bent over row",
    "description": "The cable one arm bent over row is a unilateral pulling exercise that targets the upper back, requiring core stability and coordination. It is performed using a cable machine and emphasizes controlled movement and proper form.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "cable",
    "difficulty": "intermediate",
    "instructions": [
      "Stand facing a cable machine with your feet shoulder-width apart.",
      "Bend your knees slightly and hinge forward at the hips, keeping your back straight.",
      "Grasp the cable handle with one hand, palm facing inward, and extend your arm fully.",
      "Pull the cable handle towards your body, keeping your elbow close to your side, until your hand reaches your lower chest.",
      "Pause for a moment, then slowly extend your arm back to the starting position.",
      "Repeat for the desired number of repetitions, then switch sides."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  },
  {
    "_id": "687e744ab5aea82fc84cb35e",
    "name": "cable one arm straight back high row (kneeling)",
    "description": "The cable one arm straight back high row (kneeling) is an exercise that targets the upper back, performed using a cable machine. It also engages the biceps and shoulders, and is done in a kneeling position to help isolate the upper back muscles.",
    "muscleGroup": "upper back",
    "type": "strength",
    "equipment": "cable",
    "difficulty": "intermediate",
    "instructions": [
      "Attach a handle to a cable machine at waist height.",
      "Kneel down facing the cable machine and grab the handle with one hand.",
      "Keep your back straight and your core engaged.",
      "Pull the handle towards your chest, squeezing your shoulder blades together.",
      "Pause for a moment at the top of the movement.",
      "Slowly release the handle back to the starting position.",
      "Repeat for the desired number of repetitions.",
      "Switch sides and repeat the exercise with the other arm."
    ],
    "imageUrl": "",
    "videoUrl": "",
    "createdBy": "system",
    "isPublic": true,
    "createdAt": "2025-07-24T00:00:00.000Z",
    "updatedAt": "2025-07-24T00:00:00.000Z"
  }
]
